month = int(input('введите месяц от 1 до 12: '))
monf_dict = {12: 'зима',
             1: 'зима',
             2: 'зима',
             3: 'весна',
             4: 'весна',
             5: 'весна',
             6: 'лето',
             7: 'лето',
             8: 'лето',
             9: 'осень',
             10: 'осень',
             11: 'осень'}
print(f'пример решения через словарь {monf_dict[month]}')
month_list=["зима",
            "зима",
            "весна",
            "весна",
            "весна",
            "лето",
            "лето",
            "лето",
            "осень",
            "осень",
            "осень",
            "зима"]
print(f'пример решения через лист {month_list[month-1]}')